etp-backend/src/main/resources/asha/execute-operation.xml

<soap-env:Envelope xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/">
    <soap-env:Header>
        <ns0:MessageHeader xmlns:ns0="http://vismaconsulting.fi/ebs/1.0">
            <ns0:messageVersion>1.0</ns0:messageVersion>
            <ns0:requestId>{{request-id}}</ns0:requestId>
            <ns0:senderId>{{sender-id}}</ns0:senderId>
        </ns0:MessageHeader>
    </soap-env:Header>
    <soap-env:Body>
        <ns0:executeOperations xmlns:ns0="http://vismaconsulting.fi/ebs/1.0">
            <ns0:operationRequest>
                {{#identity}}
                <ns0:IdentityChain>
                    {{#case}}
                    <ns0:CaseNumberIdentity>
                        <ns0:caseNumber>{{number}}</ns0:caseNumber>
                    </ns0:CaseNumberIdentity>
                    {{/case}}
                    {{#processing-action}}
                    <ns0:ProcessingActionNameIdentity>
                        <ns0:name>{{name-identity}}</ns0:name>
                    </ns0:ProcessingActionNameIdentity>
                    {{/processing-action}}
                </ns0:IdentityChain>
                {{/identity}}
                {{#case-info}}
                <ns0:CaseInfoQueryOperation>
                    <ns0:CaseNumberIdentity>
                        <ns0:caseNumber>{{case-number}}</ns0:caseNumber>
                    </ns0:CaseNumberIdentity>
                </ns0:CaseInfoQueryOperation>
                {{/case-info}}
                {{#processing-action-info}}
                <ns0:ActionInfoQueryOperation>
                    <ns0:IdentityChain>
                        <ns0:CaseNumberIdentity>
                            <ns0:caseNumber>{{case-number}}</ns0:caseNumber>
                        </ns0:CaseNumberIdentity>
                        <ns0:ProcessingActionNameIdentity>
                            <ns0:name>{{processing-action-name-identity}}</ns0:name>
                        </ns0:ProcessingActionNameIdentity>
                    </ns0:IdentityChain>
                </ns0:ActionInfoQueryOperation>
                {{/processing-action-info}}
                {{#processing-action}}
                <ns0:CreateProcessingActionOperation>
                    <ns0:name>{{name}}</ns0:name>
                    <!--TODO: required? <ns0:createFromProcess>{{create-from-process}}</ns0:createFromProcess>-->
                    <ns0:receptionDate>{{reception-date}}</ns0:receptionDate>
                    <ns0:contactingDirection>{{contacting-direction}}</ns0:contactingDirection>
                    <ns0:description>{{description}}</ns0:description>
                    {{#contact}}
                    <ns0:Contact>
                        <ns0:type>{{type}}</ns0:type>
                        <ns0:emailAddress>{{email-address}}</ns0:emailAddress>
                        <ns0:firstName>{{first-name}}</ns0:firstName>
                        <ns0:lastName>{{last-name}}</ns0:lastName>
                    </ns0:Contact>
                    {{/contact}}
                </ns0:CreateProcessingActionOperation>
                {{/processing-action}}
                {{#attach}}
                <ns0:AttachOperation>
                    {{#document}}
                    <ns0:Document>                                                                                                               |
                        <ns0:name>{{name}}</ns0:name>
                        <ns0:type>{{type}}</ns0:type>
                        <ns0:content>{{content}}</ns0:content>
                    </ns0:Document>
                    {{/document}}
                    {{#contact}}
                    <ns0:Contact>
                        <ns0:type>{{type}}</ns0:type>
                        <ns0:emailAddress>{{email-address}}</ns0:emailAddress>
                        <ns0:firstName>{{first-name}}</ns0:firstName>
                        <ns0:lastName>{{last-name}}</ns0:lastName>
                    </ns0:Contact>
                    {{/contact}}
                </ns0:AttachOperation>
                {{/attach}}
                {{#proceed-operation}}
                <ns0:ProceedOperation>
                    <ns0:decision>{{decision}}</ns0:decision>
                </ns0:ProceedOperation>
                {{/proceed-operation}}
                {{#start-processing}}
                <ns0:StartProcessingOperation>
                    <ns0:assignee>{{assignee}}</ns0:assignee>
                </ns0:StartProcessingOperation>
                {{/start-processing}}
            </ns0:operationRequest>
        </ns0:executeOperations>
    </soap-env:Body>
</soap-env:Envelope>